// ----------------------------------------------------------------
// 文件:BkgFrame.h
// 版本: 
// 作者: xy
// 日期: 2006-7-6
// ----------------------------------------------------------------
// 版本历史			注释
// ----------------------------------------------------------------
// v0.1				初始版本
// 
// ----------------------------------------------------------------


#pragma once

//------------------------------------------------------
// 背景框类
//------------------------------------------------------

class CBkgFrame : public CStatic
{
	DECLARE_DYNAMIC(CBkgFrame)

public:
	CBkgFrame();
	virtual ~CBkgFrame();

protected:
	DECLARE_MESSAGE_MAP()
public:
	afx_msg void OnPaint();
private:
	HBRUSH			m_hBrush;
};


