// ----------------------------------------------------------------
// 文件:MsgObj.h
// 版本: 
// 作者: xy
// 日期: 2006-7-6
// ----------------------------------------------------------------
// 版本历史			注释
// ----------------------------------------------------------------
// v0.1				初始版本
// 
// ----------------------------------------------------------------


#pragma once


#include <vector>
#include <string>
using namespace std;


enum MSGOBJ_TYPE
{
	MOT_COMMON_MSG,	// 普通信息
	MOT_WEB_PIC,	// 指定url链接的web图片
	MOT_FLASH,		// flash文件
	MOT_MOVIE,		// 影音文件信息
};

struct MSGOBJ_SEG
{
	int		nType;	// 信息类型:
	string	sData;	// 信息内容
};

typedef vector<MSGOBJ_SEG> MSGOBJARR;


//------------------------------------------------------
// 聊天信息类
//------------------------------------------------------

class CMsgObj
{
public:

	CMsgObj(void);

	~CMsgObj(void);

public:
	//------------------------------------------------------
	// 加载信息，将信息拆分为信息段（信息段有几种类型，参考MSGOBJ_TYPE）
	//------------------------------------------------------
	void				Load(const char* szMsg);
	//------------------------------------------------------
	// 获取信息中包含的图片url链接定义
	//------------------------------------------------------
	void				GetWebImage(vector<string>& arrImg) const;
	//------------------------------------------------------
	// 将信息中的图片链接替换为指定的图片名
	//------------------------------------------------------
	bool				ReplaceWebImage(const vector<string> arrName);
	//------------------------------------------------------
	// 获取信息的字符串
	//------------------------------------------------------
	string				ToMsg() const;
	//------------------------------------------------------
	// 获取信息段
	//------------------------------------------------------
	const MSGOBJARR&	GetMsgSegs() const
	{ return m_arrMsgSeg; };

protected:
	//------------------------------------------------------
	// 将信息中的转义空白字符“%20”替换为空白字符' '
	//------------------------------------------------------
	void				ProcBlank(string& sUrl);

private:
	
	MSGOBJARR		m_arrMsgSeg;

};
