/******************************************************************
** 文件名:	trace.cpp
** 版  权:	(C)  
** 创建人:	
** 日  期:	2007-5-15
** 描  述:	信息输出相关
	
**************************** 修改记录 ******************************
** 修改人: 
** 日  期: 
** 描  述: 
********************************************************************/

#include "stdafx.h"
#include "trace/Trace.h"

void Error(const char *format,...)
{
}

void Warning(const char *format,...)
{
}

void Trace(const char *format,...)
{
}


